# ord()  # Определение кода символа

# String.upper()  # Возвращает строку с буквами в большом регистре
# String.lower()  # Возвращает строку с буквами в маленьком регистре

# String.count(sub, star, end)  # Определяет число вхождений подстроки в строке

# String.find(sub, star, end)  # Возвращает индекс первого найденного вхождения
# String.frind(sub, star, end)  # Возвращает индекс первого найденного вхождения при поиске справа
# String.index(sub, star, end)  # Возвращает индекс первого найденного вхождения

# String.replace(old, new, count=-1)  # Заменяет строку old на new

# String.isalpha()  # Определяет: состоит ли строка целиком из буквенных символов
# String.isdigit()  # Определяет: состоит ли строка целиком из цифр

# String.rjust(width[, fillchar = ‘ ‘])  #  Расширяет строку, добавляя символы слева
# String.ljust(width[, fillchar = ‘ ‘])  #  Расширяет строку, добавляя символы справа

# String.split(sep=None, maxsplit=-1)  #  Разбивает строку на подстроки
# String.join(список)  # Объединяет коллекцию в строку

# String.strip()  # Удаляет пробелы и переносы строк справа и слева
# String.rstrip()  #  Удаляет пробелы и переносы строк справа
# String.lstrip()  #  Удаляет пробелы и переносы строк слева


# List.index(sub, star, end)  # Возвращает индекс первого найденного вхождения
# List.count(sub, star, end)  # Определяет число вхождений подстроки в строке

# List.append(99)  # добавляет 1 элемент в конце списка
# List.extend([sub, sub, sub])  # добавляет список элементов в конце списка
# List.insert(index, sub)  # Добавляет элемент по заданному индексу
# List.remove(sub)  # Удаляет первый по найденному совпадению элемент из списка по значению
# List.clear()  # Полностью очищает список

# List.pop(0)  # удаляет элемент по индексу (index)
# List.pop()  # удаляет последний элемент из списка () и возвращает удалённый элемент

# List.copy() # возвращает копию списка, так создаются элементы с разными ячейками памяти

# List.sort()  # отсортировали список по возрастанию (reverse=False)
# List.reverse()  # перестроили элементы списка в обратном порядке индексов
